# Trabalho 1 - Base de Dados

* Vinícius de Moraes - 13749910
* Pedro Silva dos Santos - 12688431
* Gabriel Faccini Gregoris - 13672936

In [1]:
############## Importar os módulos necessários para o Notebook:
from ipywidgets import interact  ##-- Interactors
import ipywidgets as widgets     #---
from sqlalchemy import create_engine

In [2]:
############## Conectar com um servidor SQL na base default ###################### --> Postgres.postgres
%reload_ext sql
# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost:5432/postgres')
%sql postgresql://postgres:123@localhost:5432/postgres

In [3]:
%%sql
SELECT Current_database();

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('postgres',)]

## Criando uma base de dados

In [4]:
## Desabilitar o Autocommit:
%config SqlMagic.autocommit=False

In [5]:
%%sql 
COMMIT;
DROP DATABASE IF EXISTS trabalho1 WITH (FORCE);
COMMIT;
CREATE DATABASE trabalho1
    WITH OWNER = postgres
    ENCODING = 'UTF8';
COMMIT;

 * postgresql://postgres:***@localhost:5432/postgres
Done.
Done.
Done.
Done.
Done.

[]

In [6]:
## Reabilitar o Autocommit:
%config SqlMagic.autocommit=True

In [7]:
# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:123@localhost/trabalho1')
%sql postgresql://postgres:123@localhost/trabalho1

In [8]:
%sql SELECT Current_Database();

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('trabalho1',)]

In [9]:
%sql DB << SELECT Current_Database();
print('\n  Conexão default:')
print(DB)
print('Tipo da resposta:', type(DB))

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
1 rows affected.
Returning data to local variable DB

  Conexão default:
+------------------+
| current_database |
+------------------+
|    trabalho1     |
+------------------+
Tipo da resposta: <class 'sql.run.ResultSet'>

# Exercício 3 - Criação das Tabelas

In [10]:
%%sql 

DROP TABLE IF EXISTS Endereco CASCADE;
CREATE TABLE Endereco(
    idEndereco SERIAL PRIMARY KEY,
    Logradouro VARCHAR(100) NOT NULL,
    Cidade VARCHAR(40) NOT NULL,
    Estado VARCHAR(40) NOT NULL,
    Pais VARCHAR(40) NOT NULL
    );

DROP TABLE IF EXISTS Usuario CASCADE;
CREATE TABLE Usuario(
    Nome VARCHAR(40) NOT NULL,
    Telefone VARCHAR(20) UNIQUE NOT NULL,
    Email VARCHAR(40),
    Senha VARCHAR(40),
    idEndereco INT NOT NULL,
    Sexo VARCHAR(20),
    DataNasc DATE,
    PRIMARY KEY (Nome, Telefone),
    CONSTRAINT FK_usuario_endereco
        FOREIGN KEY (idEndereco)
            REFERENCES Endereco(idEndereco)
    );

DROP TABLE IF EXISTS Propriedade CASCADE;
CREATE TABLE Propriedade(
    Nome_prop VARCHAR(40) NOT NULL,
    idEndereco INT NOT NULL,
    Nome_usuario VARCHAR(40),
    Tel_usuario VARCHAR(20),
    Classe VARCHAR(20),
    PrecoDiaria DECIMAL(10),
    TaxaLimpeza DECIMAL(10),
    MaxHospedes INT,
    MaxNoites DECIMAL(2),
    MinNoites DECIMAL(2),
    QtdBanheiros INT,
    QtdQuartos INT,
    Data_inicial DATE,
    Data_final DATE,
    Regras VARCHAR(40),
    PRIMARY KEY (Nome_prop, idEndereco),
    CONSTRAINT FK_prop_usuario
        FOREIGN KEY (Nome_usuario, Tel_usuario)
            REFERENCES Usuario(Nome, Telefone),
    CONSTRAINT FK_prop_endereco
        FOREIGN KEY (idEndereco)
            REFERENCES Endereco(idEndereco)
    );


DROP TABLE IF EXISTS Locacao CASCADE;
CREATE TABLE Locacao(
    idLocacao INT PRIMARY KEY,
    DtCheckIn DATE,
    DtCheckOut DATE,
    Dt_Reserva DATE,
    QtdHospedes DECIMAL(2),
    Valor DECIMAL(10),
    Cancelado BOOL
    );

DROP TABLE IF EXISTS Mensagem CASCADE;
CREATE TABLE Mensagem(
    Timestamp timestamp,
    Usuario_origem VARCHAR(40) NOT NULL,
    Tel_origem VARCHAR(20) NOT NULL,
    Usuario_destino VARCHAR(40) NOT NULL,
    Tel_destino VARCHAR(20) NOT NULL,
    Texto VARCHAR(200),
    CONSTRAINT FK_msg_usuario_origem
        FOREIGN KEY (Usuario_origem, Tel_origem)
            REFERENCES Usuario(Nome, Telefone),
    CONSTRAINT FK_msg_usuario_destino
        FOREIGN KEY (Usuario_destino, Tel_destino)
            REFERENCES Usuario(Nome, Telefone)
    );

DROP TABLE IF EXISTS Comodidade CASCADE;
CREATE TABLE Comodidade(
    idComodidade SERIAL PRIMARY KEY,
    Nome_prop VARCHAR(40) NOT NULL,
    Endereco_prop INT NOT NULL,
    Descricao VARCHAR(50) NOT NULL,
    CONSTRAINT FK_comodidade_propriedade
        FOREIGN KEY (Nome_prop, Endereco_prop)
            REFERENCES Propriedade(Nome_prop, idEndereco)
    );

DROP TABLE IF EXISTS Avaliacao CASCADE;
CREATE TABLE Avaliacao(
    Nome_prop VARCHAR(40) NOT NULL,
    Endereco_prop INT NOT NULL,
    Mensagem VARCHAR(200),
    Nota_comunicacao DECIMAL(2),
    Nota_limpeza DECIMAL(2),
    Nota_localizacao DECIMAL(2),
    Nota_valor DECIMAL(2),
    CONSTRAINT FK_aval_propriedade
        FOREIGN KEY (Nome_prop, Endereco_prop)
            REFERENCES Propriedade(Nome_prop, idEndereco)
    );

DROP TABLE IF EXISTS ContaBancaria CASCADE;
CREATE TABLE ContaBancaria(
    Numero INT PRIMARY KEY,
    Nome_usuario VARCHAR(40) NOT NULL,
    Tel_usuario VARCHAR(20) NOT NULL,
    Tipo VARCHAR(20),
    Numero_roteamento INT,
    CONSTRAINT FK_conta_usuario
        FOREIGN KEY (Nome_usuario, Tel_usuario)
            REFERENCES Usuario(Nome, Telefone)
    );

DROP TABLE IF EXISTS Locar CASCADE;
CREATE TABLE Locar(
    Nome_prop VARCHAR(40) NOT NULL,
    Endereco_prop INT NOT NULL,
    Nome_usuario VARCHAR(40) NOT NULL,
    Tel_usuario VARCHAR(20) NOT NULL,
    idLocacao INT NOT NULL,
    CONSTRAINT FK_locar_propriedade
        FOREIGN KEY (Nome_prop, Endereco_prop)
            REFERENCES Propriedade(Nome_prop, idEndereco),
    CONSTRAINT FK_locar_usuario
        FOREIGN KEY (Nome_usuario, Tel_usuario)
            REFERENCES Usuario(Nome, Telefone),
    CONSTRAINT FK_locar_idLocacao   
        FOREIGN KEY (idLocacao)
            REFERENCES Locacao(idLocacao)
    );

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# Exercício 4 - Inserção de Dados

In [11]:
%%sql
-- Insert dummy data into Endereco
INSERT INTO Endereco (Logradouro, Cidade, Estado, Pais) VALUES
('Rua Augusta, n° 1500, Bairro Consolação', 'São Paulo', 'SP', 'Brasil'),
('Avenida Atlântica, n° 2000, Bairro Copacabana', 'Rio de Janeiro', 'RJ', 'Brasil'),
('Avenida Afonso Pena, n° 300, Bairro Centro', 'Belo Horizonte', 'MG', 'Brasil'),
('Rua XV de Novembro, n° 400, Bairro Centro', 'Curitiba', 'PR', 'Brasil'),
('Avenida Ipiranga, n° 500, Bairro Centro Histórico', 'Porto Alegre', 'RS', 'Brasil'),
('Avenida Sete de Setembro, n° 600, Bairro Centro', 'Salvador', 'BA', 'Brasil'),
('Avenida Boa Viagem, n° 700, Bairro Boa Viagem', 'Recife', 'PE', 'Brasil'),
('Avenida Beira Mar, n° 800, Bairro Meireles', 'Fortaleza', 'CE', 'Brasil'),
('Eixo Monumental, n° 900, Bairro Zona Cívico-Administrativa', 'Brasília', 'DF', 'Brasil'),
('Avenida Eduardo Ribeiro, n° 1000, Bairro Centro', 'Manaus', 'AM', 'Brasil');

-- Insert dummy data into Usuario
INSERT INTO Usuario (Nome, Telefone, Email, Senha, idEndereco, Sexo, DataNasc) VALUES
('João Silva', '11987654321', 'joao.silva@example.com', 'senha123', 1, 'Masculino', '1985-05-15'),
('Maria Oliveira', '21987654321', 'maria.oliveira@example.com', 'senha123', 2, 'Feminino', '1990-08-20'),
('Carlos Souza', '31987654321', 'carlos.souza@example.com', 'senha123', 3, 'Masculino', '1982-11-30'),
('Ana Costa', '41987654321', 'ana.costa@example.com', 'senha123', 4, 'Feminino', '1960-02-10'),
('Pedro Lima', '51987654321', 'pedro.lima@example.com', 'senha123', 5, 'Masculino', '1978-09-25'),
('Fernanda Alves', '61987654321', 'fernanda.alves@example.com', 'senha123', 6, 'Feminino', '1987-12-05'),
('Lucas Pereira', '71987654321', 'lucas.pereira@example.com', 'senha123', 7, 'Masculino', '1992-03-14'),
('Mariana Ribeiro', '81987654321', 'mariana.ribeiro@example.com', 'senha123', 8, 'Feminino', '1989-07-19'),
('Ricardo Santos', '91987654321', 'ricardo.santos@example.com', 'senha123', 9, 'Masculino', '1983-10-22'),
('Julia Martins', '101987654321', 'julia.martins@example.com', 'senha123', 10, 'Feminino', '1991-04-18');

-- Insert dummy data into Propriedade
INSERT INTO Propriedade (Nome_prop, idEndereco, Nome_usuario, Tel_usuario, Classe, PrecoDiaria, TaxaLimpeza, MaxHospedes, MaxNoites, MinNoites, QtdBanheiros, QtdQuartos, Data_inicial, Data_final, Regras) VALUES
('Casa na Praia', 1, 'João Silva', '11987654321', 'Casa', 300.00, 50.00, 6, 30, 2, 2, 3, '2024-06-01', '2024-12-31', 'Não fumar'),
('Apartamento Central', 2, 'Maria Oliveira', '21987654321', 'Apartamento', 200.00, 40.00, 4, 15, 1, 1, 2, '2024-07-01', '2024-12-31', 'Proibido animais'),
('Chalé na Montanha', 3, 'Ricardo Santos', '91987654321', 'Chalé', 350.00, 60.00, 8, 20, 3, 3, 4, '2024-08-01', '2024-12-31', 'Manter silêncio após 22h'),
('Casa no Campo', 4, 'Ana Costa', '41987654321', 'Casa', 250.00, 30.00, 5, 25, 2, 2, 3, '2024-09-01', '2024-12-31', 'Não realizar festas'),
('Apartamento na Praia', 5, 'Pedro Lima', '51987654321', 'Apartamento', 220.00, 35.00, 4, 10, 1, 1, 2, '2024-10-01', '2024-12-31', 'Sem regras específicas'),
('Chalé na Serra', 6, 'Fernanda Alves', '61987654321', 'Chalé', 400.00, 70.00, 10, 15, 3, 3, 4, '2024-11-01', '2024-12-31', 'Não fumar'),
('Cobertura Luxo', 7, 'Lucas Pereira', '71987654321', 'Cobertura', 500.00, 80.00, 8, 30, 2, 4, 4, '2024-12-01', '2024-12-31', 'Não permitir animais'),
('Casa Moderna', 1, 'Ricardo Santos', '91987654321', 'Casa', 450.00, 75.00, 7, 20, 2, 3, 3, '2024-06-15', '2024-12-31', 'Manter limpeza'),
('Apartamento Luxo', 9, 'Ricardo Santos', '91987654321', 'Apartamento', 600.00, 90.00, 5, 25, 3, 2, 2, '2024-07-10', '2024-12-31', 'Não fumar'),
('Casa de Praia', 10, 'Julia Martins', '101987654321', 'Casa', 320.00, 55.00, 6, 30, 2, 2, 3, '2024-08-01', '2024-12-31', 'Não realizar festas');

-- Insert dummy data into Locacao
INSERT INTO Locacao (idLocacao, DtCheckIn, DtCheckOut, Dt_Reserva, QtdHospedes, Valor, Cancelado) VALUES
(1, '2024-06-10', NULL, '2024-05-15', 4, 300.00,False),
(2, '2024-07-05', '2024-07-15', '2024-06-10', 2, 200.00,False),
(3, NULL, NULL, '2024-07-01', 6, 350.00,True),
(4, '2024-09-15', '2024-09-25', '2024-08-20', 5, 250.00,False),
(5, '2024-10-10', '2024-10-20', '2024-09-15', 3, 220.00,False),
(6, NULL, NULL, '2024-10-01', 8, 400.00,True),
(7, '2024-12-15', '2024-12-25', '2024-11-10', 7, 450.00,False),
(8, '2024-06-20', '2024-06-30', '2024-05-25', 4, 320.00,False),
(9, '2023-07-15', '2024-07-25', '2024-06-20', 5, 500.00,False),
(10, '2023-08-20', NULL, '2024-07-25', 6, 300.00,False);

-- Insert dummy data into Mensagem
INSERT INTO Mensagem (Timestamp, Usuario_origem, Tel_origem, Usuario_destino, Tel_destino, Texto) VALUES
('2024-06-01 12:00:00', 'João Silva', '11987654321', 'Maria Oliveira', '21987654321', 'Olá Maria, estou interessado na sua propriedade.'),
('2024-06-02 15:30:00', 'Maria Oliveira', '21987654321', 'João Silva', '11987654321', 'Oi João, que bom! Quando você gostaria de reservar?'),
('2024-06-03 10:15:00', 'Carlos Souza', '31987654321', 'Ana Costa', '41987654321', 'Olá Ana, sua propriedade está disponível na próxima semana?'),
('2024-06-04 09:45:00', 'Ana Costa', '41987654321', 'Carlos Souza', '31987654321', 'Oi Carlos, sim, está disponível. Você quer reservar?'),
('2024-06-05 14:20:00', 'Pedro Lima', '51987654321', 'Fernanda Alves', '61987654321', 'Olá Fernanda, estou pensando em ficar na sua propriedade por 10 dias.'),
('2024-06-06 11:00:00', 'Fernanda Alves', '61987654321', 'Pedro Lima', '51987654321', 'Oi Pedro, claro! Vou fazer a reserva para você.'),
('2024-06-07 16:30:00', 'Lucas Pereira', '71987654321', 'Mariana Ribeiro', '81987654321', 'Olá Mariana, adorei as fotos da sua propriedade!'),
('2024-06-08 13:45:00', 'Mariana Ribeiro', '81987654321', 'Lucas Pereira', '71987654321', 'Oi Lucas, obrigada! Quando você quer reservar?'),
('2024-06-09 17:15:00', 'Ricardo Santos', '91987654321', 'Julia Martins', '101987654321', 'Olá Julia, sua propriedade está disponível em julho?'),
('2024-06-10 10:00:00', 'Julia Martins', '101987654321', 'Ricardo Santos', '91987654321', 'Oi Ricardo, sim, está disponível. Você quer reservar?');

-- Insert dummy data into Comodidade
INSERT INTO Comodidade (Nome_prop, Endereco_prop, Descricao) VALUES
('Casa na Praia', 1, 'Wi-Fi gratuito'),
('Casa na Praia', 1, 'Piscina'),
('Apartamento Central', 2, 'Ar-condicionado'),
('Apartamento Central', 2, 'Estacionamento'),
('Chalé na Montanha', 3, 'Churrasqueira'),
('Chalé na Montanha', 3, 'Lareira'),
('Casa no Campo', 4, 'Jardim'),
('Casa no Campo', 4, 'Varanda'),
('Apartamento na Praia', 5, 'Vista para o mar'),
('Apartamento na Praia', 5, 'Academia'),
('Chalé na Serra', 6, 'Jacuzzi'),
('Chalé na Serra', 6, 'Aquecimento central'),
('Cobertura Luxo', 7, 'Piscina privativa'),
('Cobertura Luxo', 7, 'Cinema em casa'),
('Casa Moderna', 1, 'Smart Home'),
('Casa Moderna', 1, 'Painéis solares'),
('Apartamento Luxo', 9, 'Serviço de quarto'),
('Apartamento Luxo', 9, 'Concierge'),
('Casa de Praia', 10, 'Barbecue Grill'),
('Casa de Praia', 10, 'Área de jogos');

-- Insert dummy data into Avaliacao
INSERT INTO Avaliacao (Nome_prop, Endereco_prop, Mensagem, Nota_comunicacao, Nota_limpeza, Nota_localizacao, Nota_valor) VALUES
('Casa na Praia', 1, 'Ótima experiência, casa maravilhosa!', 5, 5, 5, 4),
('Apartamento Central', 2, 'Muito bem localizado e confortável.', 4, 4, 5, 4),
('Chalé na Montanha', 3, 'Perfeito para relaxar!', 5, 5, 4, 5),
('Casa no Campo', 4, 'Lugar tranquilo e agradável.', 4, 5, 4, 4),
('Apartamento na Praia', 5, NULL, 5, 4, 5, 5);

-- Insert dummy data into ContaBancaria
INSERT INTO ContaBancaria (Numero, Nome_usuario, Tel_usuario, Tipo, Numero_roteamento) VALUES
(1001, 'João Silva', '11987654321', 'Corrente', 123456),
(1002, 'Maria Oliveira', '21987654321', 'Poupança', 654321),
(1003, 'Carlos Souza', '31987654321', 'Corrente', 112233),
(1004, 'Ana Costa', '41987654321', 'Poupança', 445566),
(1005, 'Pedro Lima', '51987654321', 'Corrente', 778899),
(1006, 'Fernanda Alves', '61987654321', 'Poupança', 998877),
(1007, 'Lucas Pereira', '71987654321', 'Corrente', 223344),
(1008, 'Mariana Ribeiro', '81987654321', 'Poupança', 556677),
(1009, 'Ricardo Santos', '91987654321', 'Corrente', 332211),
(1010, 'Julia Martins', '101987654321', 'Poupança', 667788);

-- Insert dummy data into Locar
INSERT INTO Locar (Nome_prop, Endereco_prop, Nome_usuario, Tel_usuario, idLocacao) VALUES
('Casa na Praia', 1, 'Maria Oliveira', '21987654321', 1),
('Apartamento Central', 2, 'Carlos Souza', '31987654321', 2),
('Chalé na Montanha', 3, 'Maria Oliveira', '21987654321', 3),
('Casa no Campo', 4, 'Fernanda Alves', '61987654321', 4),
('Apartamento na Praia', 5, 'Julia Martins', '101987654321', 5),
('Chalé na Serra', 6, 'Lucas Pereira', '71987654321', 6),
('Cobertura Luxo', 7, 'Ana Costa', '41987654321', 7),
('Casa Moderna', 1, 'Lucas Pereira', '71987654321', 8),
('Apartamento Luxo', 9, 'Julia Martins', '101987654321', 9),
('Casa de Praia', 10, 'Lucas Pereira', '71987654321', 10);

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
10 rows affected.
10 rows affected.
10 rows affected.
10 rows affected.
10 rows affected.
20 rows affected.
5 rows affected.
10 rows affected.
10 rows affected.

[]

In [12]:
%config SqlMagic.displaylimit = 20

# Exercício 5

Mostre o conteúdo feito para a relação que implementa o conceito de Propriedades do sistema:
- Mostre a relação inteira;
- Mostre quantas Propriedades existem de cada classe (casa inteira, etc.);
- Mostre quantas Propriedades existem de cada Cidade.

In [13]:
%%sql 
SELECT * FROM propriedade;

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('Casa na Praia', 1, 'João Silva', '11987654321', 'Casa', Decimal('300'), Decimal('50'), 6, Decimal('30'), Decimal('2'), 2, 3, datetime.date(2024, 6, 1), datetime.date(2024, 12, 31), 'Não fumar'),
 ('Apartamento Central', 2, 'Maria Oliveira', '21987654321', 'Apartamento', Decimal('200'), Decimal('40'), 4, Decimal('15'), Decimal('1'), 1, 2, datetime.date(2024, 7, 1), datetime.date(2024, 12, 31), 'Proibido animais'),
 ('Chalé na Montanha', 3, 'Ricardo Santos', '91987654321', 'Chalé', Decimal('350'), Decimal('60'), 8, Decimal('20'), Decimal('3'), 3, 4, datetime.date(2024, 8, 1), datetime.date(2024, 12, 31), 'Manter silêncio após 22h'),
 ('Casa no Campo', 4, 'Ana Costa', '41987654321', 'Casa', Decimal('250'), Decimal('30'), 5, Decimal('25'), Decimal('2'), 2, 3, datetime.date(2024, 9, 1), datetime.date(2024, 12, 31), 'Não realizar festas'),
 ('Apartamento na Praia', 5, 'Pedro Lima', '51987654321', 'Apartamento', Decimal('220'), Decimal('35'), 4, Decimal('10'), Decimal('1'), 1, 2, datetime.date(2024, 10, 1), datetime.date(2024, 12, 31), 'Sem regras específicas'),
 ('Chalé na Serra', 6, 'Fernanda Alves', '61987654321', 'Chalé', Decimal('400'), Decimal('70'), 10, Decimal('15'), Decimal('3'), 3, 4, datetime.date(2024, 11, 1), datetime.date(2024, 12, 31), 'Não fumar'),
 ('Cobertura Luxo', 7, 'Lucas Pereira', '71987654321', 'Cobertura', Decimal('500'), Decimal('80'), 8, Decimal('30'), Decimal('2'), 4, 4, datetime.date(2024, 12, 1), datetime.date(2024, 12, 31), 'Não permitir animais'),
 ('Casa Moderna', 1, 'Ricardo Santos', '91987654321', 'Casa', Decimal('450'), Decimal('75'), 7, Decimal('20'), Decimal('2'), 3, 3, datetime.date(2024, 6, 15), datetime.date(2024, 12, 31), 'Manter limpeza'),
 ('Apartamento Luxo', 9, 'Ricardo Santos', '91987654321', 'Apartamento', Decimal('600'), Decimal('90'), 5, Decimal('25'), Decimal('3'), 2, 2, datetime.date(2024, 7, 10), datetime.date(2024, 12, 31), 'Não fumar'),
 ('Casa de Praia', 10, 'Julia Martins', '101987654321', 'Casa', Decimal('320'), Decimal('55'), 6, Decimal('30'), Decimal('2'), 2, 3, datetime.date(2024, 8, 1), datetime.date(2024, 12, 31), 'Não realizar festas')]

In [14]:
%%sql
SELECT classe, count(classe) as quantidade FROM propriedade
GROUP BY classe

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[('Apartamento', 3), ('Chalé', 2), ('Casa', 4), ('Cobertura', 1)]

In [15]:
%%sql
SELECT cidade, count(cidade) as quantidade FROM propriedade as p
    JOIN endereco as e ON p.idEndereco = e.idEndereco
GROUP BY cidade

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
9 rows affected.

[('Belo Horizonte', 1),
 ('Recife', 1),
 ('Salvador', 1),
 ('Porto Alegre', 1),
 ('Curitiba', 1),
 ('Rio de Janeiro', 1),
 ('Brasília', 1),
 ('Manaus', 1),
 ('São Paulo', 2)]

# Exercício 6

Mostre as locações que foram confirmadas com check-in a partir de 2024-04-01, indicando para cada uma:
- Todos os atributos-chave das relações envolvidas,
- O total de dias locado,
- O Nome do anfitrião e o do locatário,

In [16]:
%%sql
SELECT * FROM locacao
    JOIN locar ON locacao.idLocacao = locar.idLocacao
WHERE dtcheckin > '2024-04-01'

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(1, datetime.date(2024, 6, 10), None, datetime.date(2024, 5, 15), Decimal('4'), Decimal('300'), False, 'Casa na Praia', 1, 'Maria Oliveira', '21987654321', 1),
 (2, datetime.date(2024, 7, 5), datetime.date(2024, 7, 15), datetime.date(2024, 6, 10), Decimal('2'), Decimal('200'), False, 'Apartamento Central', 2, 'Carlos Souza', '31987654321', 2),
 (4, datetime.date(2024, 9, 15), datetime.date(2024, 9, 25), datetime.date(2024, 8, 20), Decimal('5'), Decimal('250'), False, 'Casa no Campo', 4, 'Fernanda Alves', '61987654321', 4),
 (5, datetime.date(2024, 10, 10), datetime.date(2024, 10, 20), datetime.date(2024, 9, 15), Decimal('3'), Decimal('220'), False, 'Apartamento na Praia', 5, 'Julia Martins', '101987654321', 5),
 (7, datetime.date(2024, 12, 15), datetime.date(2024, 12, 25), datetime.date(2024, 11, 10), Decimal('7'), Decimal('450'), False, 'Cobertura Luxo', 7, 'Ana Costa', '41987654321', 7),
 (8, datetime.date(2024, 6, 20), datetime.date(2024, 6, 30), datetime.date(2024, 5, 25), Decimal('4'), Decimal('320'), False, 'Casa Moderna', 1, 'Lucas Pereira', '71987654321', 8)]

In [17]:
%%sql
SELECT locacao.idlocacao, locar.nome_usuario as nome_locatario, p.nome_usuario as nome_anfitriao, (dtcheckout - dtcheckin) as total_dias FROM locacao
    JOIN locar ON locacao.idLocacao = locar.idLocacao
    JOIN propriedade as p ON (p.Nome_prop, p.idEndereco) = (locar.Nome_prop, locar.endereco_prop)
WHERE dtcheckin > '2024-04-01'

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(1, 'Maria Oliveira', 'João Silva', None),
 (2, 'Carlos Souza', 'Maria Oliveira', 10),
 (4, 'Fernanda Alves', 'Ana Costa', 10),
 (5, 'Julia Martins', 'Pedro Lima', 10),
 (7, 'Ana Costa', 'Lucas Pereira', 10),
 (8, 'Lucas Pereira', 'Ricardo Santos', 10)]

# Exercício 7

Mostre o valor médio das diárias de todas as locações que foram feitas e das que foram
confirmadas em cada mês para o qual exista alguma locação na base.

In [18]:
%%sql
SELECT AVG(valor) FROM locacao
WHERE Cancelado is False

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(Decimal('317.5000000000000000'),)]

In [19]:
%%sql
SELECT * FROM locacao

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[(1, datetime.date(2024, 6, 10), None, datetime.date(2024, 5, 15), Decimal('4'), Decimal('300'), False),
 (2, datetime.date(2024, 7, 5), datetime.date(2024, 7, 15), datetime.date(2024, 6, 10), Decimal('2'), Decimal('200'), False),
 (3, None, None, datetime.date(2024, 7, 1), Decimal('6'), Decimal('350'), True),
 (4, datetime.date(2024, 9, 15), datetime.date(2024, 9, 25), datetime.date(2024, 8, 20), Decimal('5'), Decimal('250'), False),
 (5, datetime.date(2024, 10, 10), datetime.date(2024, 10, 20), datetime.date(2024, 9, 15), Decimal('3'), Decimal('220'), False),
 (6, None, None, datetime.date(2024, 10, 1), Decimal('8'), Decimal('400'), True),
 (7, datetime.date(2024, 12, 15), datetime.date(2024, 12, 25), datetime.date(2024, 11, 10), Decimal('7'), Decimal('450'), False),
 (8, datetime.date(2024, 6, 20), datetime.date(2024, 6, 30), datetime.date(2024, 5, 25), Decimal('4'), Decimal('320'), False),
 (9, datetime.date(2023, 7, 15), datetime.date(2024, 7, 25), datetime.date(2024, 6, 20), Decimal('5'), Decimal('500'), False),
 (10, datetime.date(2023, 8, 20), None, datetime.date(2024, 7, 25), Decimal('6'), Decimal('300'), False)]

In [20]:
%%sql
SELECT EXTRACT(MONTH FROM dtcheckin) AS mes, AVG(valor) FROM locacao
WHERE Cancelado is False
GROUP BY mes
ORDER BY mes

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(Decimal('6'), Decimal('310.0000000000000000')),
 (Decimal('7'), Decimal('350.0000000000000000')),
 (Decimal('8'), Decimal('300.0000000000000000')),
 (Decimal('9'), Decimal('250.0000000000000000')),
 (Decimal('10'), Decimal('220.0000000000000000')),
 (Decimal('12'), Decimal('450.0000000000000000'))]

# Exercı́cio 8:
Mostre os anfitriões que tiveram pelo menos 3 locações, mostrando seu nome, sua
cidade e quantidade de imóveis dos quais ele é dono.

In [21]:
%%sql 
SELECT * from usuario

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('João Silva', '11987654321', 'joao.silva@example.com', 'senha123', 1, 'Masculino', datetime.date(1985, 5, 15)),
 ('Maria Oliveira', '21987654321', 'maria.oliveira@example.com', 'senha123', 2, 'Feminino', datetime.date(1990, 8, 20)),
 ('Carlos Souza', '31987654321', 'carlos.souza@example.com', 'senha123', 3, 'Masculino', datetime.date(1982, 11, 30)),
 ('Ana Costa', '41987654321', 'ana.costa@example.com', 'senha123', 4, 'Feminino', datetime.date(1960, 2, 10)),
 ('Pedro Lima', '51987654321', 'pedro.lima@example.com', 'senha123', 5, 'Masculino', datetime.date(1978, 9, 25)),
 ('Fernanda Alves', '61987654321', 'fernanda.alves@example.com', 'senha123', 6, 'Feminino', datetime.date(1987, 12, 5)),
 ('Lucas Pereira', '71987654321', 'lucas.pereira@example.com', 'senha123', 7, 'Masculino', datetime.date(1992, 3, 14)),
 ('Mariana Ribeiro', '81987654321', 'mariana.ribeiro@example.com', 'senha123', 8, 'Feminino', datetime.date(1989, 7, 19)),
 ('Ricardo Santos', '91987654321', 'ricardo.santos@example.com', 'senha123', 9, 'Masculino', datetime.date(1983, 10, 22)),
 ('Julia Martins', '101987654321', 'julia.martins@example.com', 'senha123', 10, 'Feminino', datetime.date(1991, 4, 18))]

In [22]:
%%sql
SELECT nome, e.cidade, count(nome_prop) as qtd_imoveis FROM usuario
    JOIN endereco e ON e.idendereco = usuario.idendereco
    JOIN propriedade ON (Nome_usuario, Tel_usuario) = (nome, telefone)
GROUP BY nome, e.cidade

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Julia Martins', 'Manaus', 1),
 ('Pedro Lima', 'Porto Alegre', 1),
 ('Fernanda Alves', 'Salvador', 1),
 ('Maria Oliveira', 'Rio de Janeiro', 1),
 ('Ana Costa', 'Curitiba', 1),
 ('João Silva', 'São Paulo', 1),
 ('Ricardo Santos', 'Brasília', 3),
 ('Lucas Pereira', 'Recife', 1)]

In [23]:
%%sql
SELECT nome, e.cidade, count(p.nome_prop) as qtd_imoveis, COUNT(l.idLocacao) AS qtd_locacoes FROM usuario u
    JOIN endereco e ON e.idendereco = u.idendereco
    JOIN propriedade p ON (p.Nome_usuario, p.Tel_usuario) = (u.nome, u.telefone)
    JOIN locar l ON (l.nome_prop, l.endereco_prop) = (p.nome_prop, p.idendereco)
GROUP BY nome, e.cidade
HAVING COUNT(l.idLocacao) >= 3
ORDER BY qtd_locacoes DESC

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Ricardo Santos', 'Brasília', 3, 3)]

# Exercı́cio 9:
Mostre os usuários que são tanto anfitriões quanto locatários.

In [24]:
%%sql
SELECT l.nome_usuario AS qtd_locatário FROM locar l
    JOIN propriedade p ON (p.Nome_usuario, p.Tel_usuario) = (l.nome_usuario, l.tel_usuario)
GROUP BY l.nome_usuario

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Ana Costa',),
 ('Fernanda Alves',),
 ('Julia Martins',),
 ('Lucas Pereira',),
 ('Maria Oliveira',)]

# Exercı́cio 10:
Mostre:
- Os locatários que são mais jovens do que algum anfitrião.
- Os locatários que são mais jovens do que todos os anfitriões.

In [25]:
%%sql
SELECT DISTINCT l.nome_usuario as locatários, u.datanasc FROM Locar l
    JOIN usuario u ON (u.nome, u.telefone) = (l.Nome_usuario, l.Tel_usuario)

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[('Carlos Souza', datetime.date(1982, 11, 30)),
 ('Ana Costa', datetime.date(1960, 2, 10)),
 ('Maria Oliveira', datetime.date(1990, 8, 20)),
 ('Fernanda Alves', datetime.date(1987, 12, 5)),
 ('Lucas Pereira', datetime.date(1992, 3, 14)),
 ('Julia Martins', datetime.date(1991, 4, 18))]

In [26]:
%%sql
SELECT DISTINCT p.nome_usuario as anfitriões, u.datanasc FROM propriedade p
    JOIN usuario u ON (u.nome, u.telefone) = (p.Nome_usuario, p.Tel_usuario)

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Ricardo Santos', datetime.date(1983, 10, 22)),
 ('Maria Oliveira', datetime.date(1990, 8, 20)),
 ('Fernanda Alves', datetime.date(1987, 12, 5)),
 ('João Silva', datetime.date(1985, 5, 15)),
 ('Lucas Pereira', datetime.date(1992, 3, 14)),
 ('Ana Costa', datetime.date(1960, 2, 10)),
 ('Julia Martins', datetime.date(1991, 4, 18)),
 ('Pedro Lima', datetime.date(1978, 9, 25))]

In [27]:
%%sql
SELECT DISTINCT l.nome_usuario AS locatarios, u1.datanasc AS dataNascLocatario
FROM Locar l
JOIN usuario u1 ON u1.nome = l.nome_usuario AND u1.telefone = l.tel_usuario
WHERE EXISTS (
    SELECT 1
    FROM propriedade p
    JOIN usuario u2 ON u2.nome = p.nome_usuario AND u2.telefone = p.tel_usuario
    WHERE u2.datanasc < u1.datanasc
);

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Carlos Souza', datetime.date(1982, 11, 30)),
 ('Fernanda Alves', datetime.date(1987, 12, 5)),
 ('Julia Martins', datetime.date(1991, 4, 18)),
 ('Lucas Pereira', datetime.date(1992, 3, 14)),
 ('Maria Oliveira', datetime.date(1990, 8, 20))]

In [28]:
%%sql
SELECT DISTINCT l.nome_usuario AS locatarios, u1.datanasc AS dataNascLocatario
FROM Locar l
JOIN usuario u1 ON u1.nome = l.nome_usuario AND u1.telefone = l.tel_usuario
WHERE NOT EXISTS (
    SELECT 1
    FROM propriedade p
    JOIN usuario u2 ON u2.nome = p.nome_usuario AND u2.telefone = p.tel_usuario
    WHERE u2.datanasc > u1.datanasc
);

 * postgresql://postgres:***@localhost/trabalho1
   postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Lucas Pereira', datetime.date(1992, 3, 14))]